Repository: winnysan/clipboard-app
Catalog: Clipboard/Resources/Localizable.xcstrings
Source language: en
Languages: sk

# about_app
source: About Clipboard
sk: O Clipboard

source: About Project
sk: O projekte

# accessibility_permission_location
source: Permission can be granted in: System Settings → Privacy & Security → Accessibility
sk: Oprávnenie je možné udeliť v: Systémové nastavenia → Súkromie a bezpečnosť → Prístupnosť

# accessibility_permission_message
source: The application needs permission to track keyboard shortcuts. Enable it in System Settings > Privacy & Security > Accessibility.
sk: Aplikácia potrebuje oprávnenie na sledovanie klávesových skratiek. Povoľte ju v Systémové nastavenia > Súkromie a bezpečnosť > Prístupnosť.

# accessibility_permission_notice
source: This app requires Accessibility access to respond to system-wide keyboard shortcuts.
sk: Táto aplikácia vyžaduje prístup k funkcii "Prístupnosť" (Accessibility), aby mohla reagovať na systémové klávesové skratky.

source: Accessibility permission required
sk: Oprávnenie požadované

source: Allow
sk: Povoliť

# application_has_no_permissions
source: ⚠️ The application does not have access to the keyboard controls.
sk: ⚠️ Aplikácia nemá prístup k ovládaniu klávesnice.

source: Cancel
sk: Zrušiť

# clipboard_about_description
source: Clipboard is a simple yet powerful app for managing your clipboard. It allows you to copy and paste text and images, store history, pin important items, and reuse them quickly.
sk: Clipboard je jednoduchá, ale výkonná aplikácia pre správu vašej schránky. Umožňuje kopírovať a vkladať texty a obrázky, ukladať ich do histórie, pripínať dôležité položky a rýchlo ich opätovne použiť.

# clipboard_app_title
source: Clipboard
sk: Schránka

source: Close
sk: Zavrieť

source: Close window on paste
sk: Zatvoriť okno pri vložení

source: Enable keyboard shortcuts
sk: Povoliť klávesové skratky

# feature_autostart
source: Launch at startup
sk: Spustenie pri štarte

# feature_history
source: Funkcia: História schránky
sk: História schránky

# feature_images
source: Image support
sk: Podpora obrázkov

# feature_pin
source: Pin items
sk: Pripínanie položiek

# feature_shortcuts
source: Keyboard shortcuts
sk: Klávesové skratky

# launch_prompt_message
source: Do you want the app to launch automatically at system startup?
sk: Chcete, aby sa aplikácia spustila automaticky pri štarte systému?

# launch_prompt_title
source: Enable automatic startup?
sk: Povoliť automatické spustenie?

# monitor_clipboard
source: Monitor the system clipboard
sk: Sledovať systémovú schránku

source: Open settings
sk: Otvoriť nastavenia

source: Open window on copy
sk: Otvoriť okno pri kopírovaní

# quit
source: Quit Application
sk: Ukončiť aplikáciu

source: Start at Login
sk: Spustiť pri štarte

source: Support Development
sk: Podporiť vývoj
